cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'balena-cli'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'fd'
brew 'fzf'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'go'
brew 'jq'
brew 'lsd'
brew 'make'
brew 'mas'
brew 'ninja'
brew 'nvm'
brew 'powerlevel10k'
brew 'rsync'
brew 'rustup'
brew 'stlink'
brew 'wget'
brew 'wireshark'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'font-meslo-for-powerlevel10k'
cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite'
cask 'inkscape'
cask 'iterm2'
cask 'kap'
cask 'kicad'
cask 'logi-options-plus'
cask 'maccy'
cask 'macfuse'
cask 'notion'
cask 'plex'
cask 'qgis'
cask 'rar'
cask 'sequel-ace'
cask 'tunnelblick'
cask 'veracrypt'
cask 'visual-studio-code'
cask 'vlc'

# Install App Store applications
mas 'Amphetamine', id: 937_984_704
mas 'Greenshot', id: 1_103_915_944 # Paid
mas 'Magnet', id: 441_258_766 # Paid
mas 'WireGuard', id: 1_451_685_025

# Install Visual Studio Code extensions
vscode 'andyyaldoo.vscode-json'
vscode 'dotenv.dotenv-vscode'
vscode 'EditorConfig.EditorConfig'
vscode 'esbenp.prettier-vscode'
vscode 'PKief.material-icon-theme'
vscode 'samverschueren.linter-xo'
vscode 'bierner.markdown-emoji'
vscode 'bierner.markdown-footnotes'
vscode 'bierner.markdown-mermaid'
vscode 'yzhang.markdown-all-in-one'
vscode 'dustypomerleau.rust-syntax'
vscode 'rust-lang.rust-analyzer'
vscode 'serayuzgur.crates'
vscode 'ms-vscode.cmake-tools'
vscode 'ms-vscode.cpptools-themes'
vscode 'ms-vscode.cpptools'
vscode 'twxs.cmake'
