cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'balena-cli'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'fd'
brew 'fzf'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'go'
brew 'httpie'
brew 'jq'
brew 'lsd'
brew 'make'
brew 'mas'
brew 'ninja'
brew 'nvm'
brew 'pipx'
brew 'powerlevel10k'
brew 'python@3.12'
brew 'rsync'
brew 'rustup'
brew 'stlink'
brew 'wget'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask '1password-cli'
cask '1password'
cask 'adobe-acrobat-reader'
cask 'alt-tab'
cask 'balenaetcher'
cask 'beekeeper-studio'
cask 'chatgpt'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'font-meslo-for-powerlevel10k'
cask 'fuse-t'
cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite'
cask 'inkscape'
cask 'iterm2@beta'
cask 'kicad'
cask 'logi-options-plus'
cask 'maccy'
cask 'notion'
cask 'plex'
cask 'qgis'
cask 'rar'
cask 'raycast'
cask 'sequel-ace'
cask 'shottr'
cask 'steam'
cask 'tunnelblick'
cask 'veracrypt-fuse-t'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'

# Install App Store applications
mas 'Magnet', id: 441_258_766 # Paid
mas 'WireGuard', id: 1_451_685_025

# Install Visual Studio Code extensions
vscode 'ms-vscode.cmake-tools'
vscode 'twxs.cmake'
vscode 'github.copilot-chat'
vscode 'github.copilot'
vscode 'ms-vscode.cpptools-themes'
vscode 'ms-vscode.cpptools'
vscode 'serayuzgur.crates'
vscode 'dotenv.dotenv-vscode'
vscode 'EditorConfig.EditorConfig'
vscode 'samverschueren.linter-xo'
vscode 'yzhang.markdown-all-in-one'
vscode 'bierner.markdown-emoji'
vscode 'bierner.markdown-footnotes'
vscode 'bierner.markdown-mermaid'
vscode 'PKief.material-icon-theme'
vscode 'esbenp.prettier-vscode'
vscode 'rust-lang.rust-analyzer'
vscode 'gurumukhi.selected-lines-count'
vscode 'github.vscode-github-actions'
vscode 'andyyaldoo.vscode-json'
vscode 'github.vscode-pull-request-github'
