cask_args appdir: '/Applications'

tap 'dotenvx/brew'

brew 'bat'
brew 'curl'
brew 'eza'
brew 'dotenvx'
brew 'fd'
brew 'fzf'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'jq'
brew 'mas'
brew 'mise'
brew 'openssh'
brew 'rsync'
brew 'starship'
brew 'stlink'
brew 'wget'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask '1password-cli'
cask '1password'
cask 'alt-tab'
cask 'brave-browser'
cask 'chatgpt'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'font-meslo-lg-nerd-font'
cask 'fuse-t'
cask 'ghostty'
cask 'google-drive'
cask 'inkscape'
cask 'logi-options-plus'
cask 'notion'
cask 'plex'
cask 'rar'
cask 'raycast'
cask 'sequel-ace'
cask 'shottr'
cask 'steam'
cask 'tunnelblick'
cask 'veracrypt-fuse-t'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'

# Install App Store applications
mas 'WireGuard', id: 1_451_685_025

# Install Visual Studio Code extensions
vscode 'catppuccin.catppuccin-vsc-icons'
vscode 'catppuccin.catppuccin-vsc'
vscode 'streetsidesoftware.code-spell-checker'
vscode 'github.copilot-chat'
vscode 'github.copilot'
vscode 'fill-labs.dependi'
vscode 'dotenv.dotenv-vscode'
vscode 'manuthebyte.dynamic-icon-theme'
vscode 'EditorConfig.EditorConfig'
vscode 'tamasfe.even-better-toml'
vscode 'golang.go'
vscode 'samverschueren.linter-xo'
vscode 'yzhang.markdown-all-in-one'
vscode 'bierner.markdown-emoji'
vscode 'bierner.markdown-footnotes'
vscode 'bierner.markdown-mermaid'
vscode 'esbenp.prettier-vscode'
vscode 'rust-lang.rust-analyzer'
vscode 'gurumukhi.selected-lines-count'
vscode 'github.vscode-github-actions'
vscode 'andyyaldoo.vscode-json'
vscode 'github.vscode-pull-request-github'
